// Хук useState позволяет добавить в функциональный компонент состояние, которое будет сохраняться при его перерендерах. При изменении этого состояния компонент будет перерисовываться. Наличие такого состояния позволяет реализовывать динамические компоненты, содержимое которых будет изменяться, например, при взаимодействии с ним пользователя.

// useState сохраняет значение между рендерами и, когда меняешь значение,  React перерисовывает компонент

import { useState, ReactElement } from 'react';

type Theme = 'светлая' | 'тёмная';

export function ThemeToggle(): ReactElement {
  // Начальное состояние компонента и функция для изменения состояния
  // [текущееЗначение, функцияЧтобыЕгоИзменить] = вызов хука с начальным значением
  const [theme, setTheme] = useState<Theme>('светлая');

  // Обработчик клика на кнопку
  const toggleTheme = () => {
    // Вызов функции для изменения состояния
    setTheme(theme === 'светлая' ? 'тёмная' : 'светлая');
  };

  const themeClass = theme === 'светлая' ? 'th-light' : 'th-dark';
  const buttonImage = theme === 'светлая' ? '🌞' : '🌚';

  return (
    <div className={themeClass}>
      <p>Включена {theme} тема</p>
      <button onClick={toggleTheme}>{buttonImage}</button>
    </div>
  );
}
